packages.dot
digraph "packages" {
rankdir=BT
charset="utf-8"
"graphical" [color="black", label=<graphical>, shape="box", style="solid"];
"graphical.__main__" [color="black", label=<graphical.__main__>, shape="box", style="solid"];
"graphical.colours" [color="black", label=<graphical.colours>, shape="box", style="solid"];
"graphical.gui" [color="black", label=<graphical.gui>, shape="box", style="solid"];
"graphical.gui.button" [color="black", label=<graphical.gui.button>, shape="box", style="solid"];
"graphical.gui.element" [color="black", label=<graphical.gui.element>, shape="box", style="solid"];
"graphical.gui.vstack" [color="black", label=<graphical.gui.vstack>, shape="box", style="solid"];
"graphical.icons" [color="black", label=<graphical.icons>, shape="box", style="solid"];
"graphical.scene" [color="black", label=<graphical.scene>, shape="box", style="solid"];
"graphical.scenes" [color="black", label=<graphical.scenes>, shape="box", style="solid"];
"graphical.scenes.how_to_play" [color="black", label=<graphical.scenes.how_to_play>, shape="box", style="solid"];
"graphical.scenes.level_select" [color="black", label=<graphical.scenes.level_select>, shape="box", style="solid"];
"graphical.scenes.menu" [color="black", label=<graphical.scenes.menu>, shape="box", style="solid"];
"graphical.scenes.paused" [color="black", label=<graphical.scenes.paused>, shape="box", style="solid"];
"graphical.scenes.playing" [color="black", label=<graphical.scenes.playing>, shape="box", style="solid"];
"graphical.scenes.playing.renderer" [color="black", label=<graphical.scenes.playing.renderer>, shape="box", style="solid"];
"graphical.scenes.playing.scene" [color="black", label=<graphical.scenes.playing.scene>, shape="box", style="solid"];
"graphical.utils" [color="black", label=<graphical.utils>, shape="box", style="solid"];
"wumpus" [color="black", label=<wumpus>, shape="box", style="solid"];
"wumpus.cave" [color="black", label=<wumpus.cave>, shape="box", style="solid"];
"wumpus.events" [color="black", label=<wumpus.events>, shape="box", style="solid"];
"wumpus.hazards" [color="black", label=<wumpus.hazards>, shape="box", style="solid"];
"wumpus.level" [color="black", label=<wumpus.level>, shape="box", style="solid"];
"wumpus.levels" [color="black", label=<wumpus.levels>, shape="box", style="solid"];
"wumpus.player" [color="black", label=<wumpus.player>, shape="box", style="solid"];
"wumpus.tests" [color="black", label=<wumpus.tests>, shape="box", style="solid"];
"wumpus.tests.test_hazards" [color="black", label=<wumpus.tests.test_hazards>, shape="box", style="solid"];
"wumpus.tests.test_player" [color="black", label=<wumpus.tests.test_player>, shape="box", style="solid"];
"graphical.__main__" -> "graphical.scene" [arrowhead="open", arrowtail="none"];
"graphical.__main__" -> "graphical.scenes.menu" [arrowhead="open", arrowtail="none"];
"graphical.gui" -> "graphical.gui.button" [arrowhead="open", arrowtail="none"];
"graphical.gui" -> "graphical.gui.vstack" [arrowhead="open", arrowtail="none"];
"graphical.gui.button" -> "graphical.gui.element" [arrowhead="open", arrowtail="none"];
"graphical.gui.vstack" -> "graphical.gui.element" [arrowhead="open", arrowtail="none"];
"graphical.scenes" -> "graphical.scenes.how_to_play" [arrowhead="open", arrowtail="none"];
"graphical.scenes" -> "graphical.scenes.level_select" [arrowhead="open", arrowtail="none"];
"graphical.scenes" -> "graphical.scenes.menu" [arrowhead="open", arrowtail="none"];
"graphical.scenes" -> "graphical.scenes.playing.scene" [arrowhead="open", arrowtail="none"];
"graphical.scenes.level_select" -> "graphical.scenes.menu" [arrowhead="open", arrowtail="none"];
"graphical.scenes.level_select" -> "graphical.scenes.playing" [arrowhead="open", arrowtail="none"];
"graphical.scenes.menu" -> "graphical.scenes.how_to_play" [arrowhead="open", arrowtail="none"];
"graphical.scenes.menu" -> "graphical.scenes.level_select" [arrowhead="open", arrowtail="none"];
"graphical.scenes.paused" -> "graphical.scenes.how_to_play" [arrowhead="open", arrowtail="none"];
"graphical.scenes.paused" -> "graphical.scenes.menu" [arrowhead="open", arrowtail="none"];
"graphical.scenes.playing" -> "graphical.scenes.playing.scene" [arrowhead="open", arrowtail="none"];
"graphical.scenes.playing.renderer" -> "graphical.colours" [arrowhead="open", arrowtail="none"];
"graphical.scenes.playing.renderer" -> "graphical.utils" [arrowhead="open", arrowtail="none"];
"graphical.scenes.playing.renderer" -> "wumpus.hazards" [arrowhead="open", arrowtail="none"];
"graphical.scenes.playing.renderer" -> "wumpus.level" [arrowhead="open", arrowtail="none"];
"graphical.scenes.playing.scene" -> "graphical.colours" [arrowhead="open", arrowtail="none"];
"graphical.scenes.playing.scene" -> "graphical.scene" [arrowhead="open", arrowtail="none"];
"graphical.scenes.playing.scene" -> "graphical.scenes.paused" [arrowhead="open", arrowtail="none"];
"graphical.scenes.playing.scene" -> "graphical.scenes.playing.renderer" [arrowhead="open", arrowtail="none"];
"graphical.scenes.playing.scene" -> "wumpus" [arrowhead="open", arrowtail="none"];
"graphical.scenes.playing.scene" -> "wumpus.levels" [arrowhead="open", arrowtail="none"];
"wumpus" -> "wumpus.cave" [arrowhead="open", arrowtail="none"];
"wumpus" -> "wumpus.level" [arrowhead="open", arrowtail="none"];
"wumpus" -> "wumpus.player" [arrowhead="open", arrowtail="none"];
"wumpus.hazards" -> "wumpus.cave" [arrowhead="open", arrowtail="none"];
"wumpus.hazards" -> "wumpus.events" [arrowhead="open", arrowtail="none"];
"wumpus.level" -> "wumpus.cave" [arrowhead="open", arrowtail="none"];
"wumpus.level" -> "wumpus.events" [arrowhead="open", arrowtail="none"];
"wumpus.level" -> "wumpus.hazards" [arrowhead="open", arrowtail="none"];
"wumpus.player" -> "wumpus.events" [arrowhead="open", arrowtail="none"];
"wumpus.player" -> "wumpus.hazards" [arrowhead="open", arrowtail="none"];
"wumpus.player" -> "wumpus.level" [arrowhead="open", arrowtail="none"];
"wumpus.tests.test_hazards" -> "wumpus" [arrowhead="open", arrowtail="none"];
"wumpus.tests.test_hazards" -> "wumpus.cave" [arrowhead="open", arrowtail="none"];
"wumpus.tests.test_hazards" -> "wumpus.events" [arrowhead="open", arrowtail="none"];
"wumpus.tests.test_hazards" -> "wumpus.hazards" [arrowhead="open", arrowtail="none"];
"wumpus.tests.test_player" -> "wumpus" [arrowhead="open", arrowtail="none"];
"wumpus.tests.test_player" -> "wumpus.levels" [arrowhead="open", arrowtail="none"];
}
